Examinator/src/DataProcessors/ИмпортСтудентовОО/ИмпортСтудентовОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИмпортСтудентовОО</name>
  <attributes>
    <name>ТипИнформационнойБазыДляПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазыНаСервереДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindowsИнформационнойБазыДляПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗагрузкаСтудентов</name>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Специализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПользователей</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отделение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходВПрограммуРазрешен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияСтандартная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияOpenID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияВебКабинета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрещеноИзменятьПароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьВСпискеВыбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьДоступаВДнях</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроведенияПрограммыОбучения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНовости</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/ПользователиВебКабинетаСУ/ПользователиВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиВебКабинетаСУ</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СтудентыОО/СтудентыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтудентыОО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.КурсыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСтудентовОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.СпециализацииОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ВремяДоступаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяДоступаПользователейСУО</name>
  <attributes>
    <name>ДатаНачалаДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/DataProcessors/ИмпортСтудентовОО/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");		
	Если ДанныеНастроек = Неопределено Тогда
		СоздаватьЭлементыСправочниковПриИхОтсутствии = Истина;			
	КонецЕсли;
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ТипИнформационнойБазыДляПодключенияПриИзмененииЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипИнформационнойБазыДляПодключенияПриИзменении(Элемент)
	ТипИнформационнойБазыДляПодключенияПриИзмененииЗначения();
КонецПроцедуры

&НаКлиенте
Процедура КаталогИнформационнойБазыДляПодключенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите каталог информационной базы'");
	ДиалогВыбораФайла.Каталог = Объект.КаталогИнформационнойБазыДляПодключения;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		Объект.КаталогИнформационнойБазыДляПодключения = ДиалогВыбораФайла.Каталог;
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КаталогИнформационнойБазыДляПодключенияОткрытие(Элемент, СтандартнаяОбработка)
	ОткрытьВПриложении(Элемент.ТекстРедактирования, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияWindowsИнформационнойБазыДляПодключенияПриИзменении(Элемент)
	Элементы.ПользовательИнформационнойБазыДляПодключения.Доступность = НЕ Объект.АутентификацияWindowsИнформационнойБазыДляПодключения;
	Элементы.ПарольИнформационнойБазыДляПодключения.Доступность = НЕ Объект.АутентификацияWindowsИнформационнойБазыДляПодключения;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	РежимЗагрузки = "Файл";
	УстановитьВидимостьЭлементовФормы();
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжениеЗагрузкиФайла", ЭтотОбъект);				
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);	

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяКБазеКолледж(Команда)	
	НачатьПодключение("ПравилаОбмена_Колледж_ОО", "1С:Колледж");
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяКБазеУниверситет(Команда)	
	НачатьПодключение("ПравилаОбмена_Университет_ОО", "1С:Университет");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
		
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	
    ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Обработка.ИмпортСтудентовОО.ТабличнаяЧасть.ЗагрузкаСтудентов";
    ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузить студентов'");
	ПараметрыЗагрузки.ИмяМакетаСШаблоном = "ЗагрузкаИзФайла";
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьСтудентовИзФайлаЗавершение", ЭтотОбъект); 
    ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТаблицы(Команда)
	ЗаписатьСтудентовИзТаблицы();
	ПоказатьПредупреждение(,НСтр("ru = 'Загрузка успешно завершена'"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Загрузка из таблицы

&НаКлиенте
Процедура ЗаполнитьСтудентовИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
        Возврат;
    КонецЕсли;
	
	РежимЗагрузки = "Таблица";
	
	ЗаполнитьСтудентовИзФайлаЗавершениеНаСервере(АдресЗагруженныхДанных);
	
	ЕстьЗаписиСПустымИменем = (Объект.ЗагрузкаСтудентов.НайтиСтроки(Новый Структура("ПолноеИмя", "")).Количество() > 0);
	
	Если ЕстьЗаписиСПустымИменем Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для всех записей должна быть заполнена колонка Полное имя'"));
		Объект.ЗагрузкаСтудентов.Очистить();
		Возврат;
	КонецЕсли;
	
	ЕстьПропущенныеСтуденты = (Объект.ЗагрузкаСтудентов.НайтиСтроки(Новый Структура("Пропустить", Истина)).Количество() > 0);
	
	Если ЕстьПропущенныеСтуденты Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Есть записи, для которых найдено более одного пользователя. Они будут пропущены'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтудентовИзФайлаЗавершениеНаСервере(АдресЗагруженныхДанных)
	
	Объект.ЗагрузкаСтудентов.Очистить();
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);	
	ЗагруженныеДанные.Колонки.Удалить("Идентификатор");
	ЗагруженныеДанные.Колонки.Удалить("ОписаниеОшибки");
	ЗагруженныеДанные.Колонки.Удалить("РезультатСопоставленияСтроки");
	Для каждого СтрокаТЗД Из ЗагруженныеДанные Цикл	
		НоваяСтрокаТЧ = Объект.ЗагрузкаСтудентов.Добавить();
		Для каждого Колонка Из ЗагруженныеДанные.Колонки Цикл
			НоваяСтрокаТЧ[Колонка.Имя] = СтрокаТЗД[Колонка.Имя];
		КонецЦикла;	
		Если ЗначениеЗаполнено(СтрокаТЗД.Пользователь) Тогда
			НоваяСтрокаТЧ.НайденВБазе = Истина;
		КонецЕсли;
	КонецЦикла;
		
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтудентовИзТаблицы()
	
	Результат = ""; // Будет показан в форме
	
	НачатьТранзакцию();
	
	Попытка
		
		МассивГруппПользователей = Новый Массив;
		МассивГруппПользователей.Добавить(Справочники.ГруппыПользователей.ВсеПользователи);		
		
		Для каждого СтрокаТЧ Из Объект.ЗагрузкаСтудентов Цикл
			
			Если СтрокаТЧ.Пропустить Тогда
				Продолжить;
			КонецЕсли;
			
			// Создаем пользователя
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Пользователь) Тогда
				ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
			Иначе
				ПользовательОбъект = СтрокаТЧ.Пользователь.ПолучитьОбъект();
				ПользовательОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета",
					РегистрыСведений.ПользователиВебКабинетаСУ.ПользовательСуществует(, ПользовательОбъект.Ссылка));
			КонецЕсли;	
			
			ПользовательОбъект.Код = СтрокаТЧ.Код;
			ПользовательОбъект.Наименование = СтрокаТЧ.ПолноеИмя;			
			
			ОписаниеПользователяИБ = Новый Структура;
			
			ОписаниеПользователяИБ.Вставить("Действие", "Записать");
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ВходВПрограммуРазрешен) Тогда
				ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.ВходВПрограммуРазрешен));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.АутентификацияСтандартная) Тогда
				ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.АутентификацияСтандартная));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.АутентификацияОС) Тогда
				ОписаниеПользователяИБ.Вставить("АутентификацияОС", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.АутентификацияОС));				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.АутентификацияOpenID) Тогда				
				ОписаниеПользователяИБ.Вставить("АутентификацияOpenID", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.АутентификацияOpenID));
			КонецЕсли;				
						
			Если ЗначениеЗаполнено(СтрокаТЧ.Имя) Тогда
				ОписаниеПользователяИБ.Вставить("Имя", СтрокаТЧ.Имя);
			Иначе
				ОписаниеПользователяИБ.Вставить("Имя", ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(СтрокаТЧ.ПолноеИмя));
			КонецЕсли;
			
			ОписаниеПользователяИБ.Вставить("ПолноеИмя", СтрокаТЧ.ПолноеИмя);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Пароль) Тогда
				ОписаниеПользователяИБ.Вставить("Пароль", СтрокаТЧ.Пароль);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ЗапрещеноИзменятьПароль) Тогда
				ОписаниеПользователяИБ.Вставить("ЗапрещеноИзменятьПароль", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.ЗапрещеноИзменятьПароль));				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ПользовательОС) Тогда
				ОписаниеПользователяИБ.Вставить("ПользовательОС", СтрокаТЧ.ПользовательОС);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ПоказыватьВСпискеВыбора) Тогда
				ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.ПоказыватьВСпискеВыбора));				
			КонецЕсли;
			
			ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.АутентификацияВебКабинета) Тогда
				ПользовательОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета", 
					ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(СтрокаТЧ.АутентификацияВебКабинета));				
			КонецЕсли;

			
			Если ЗначениеЗаполнено(СтрокаТЧ.ЭлектроннаяПочта) ИЛИ ЗначениеЗаполнено(СтрокаТЧ.Телефон) Тогда
				
				КонтактнаяИнформацияДляЗаполнения = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация(Ложь);
				
				Если ЗначениеЗаполнено(СтрокаТЧ.ЭлектроннаяПочта) Тогда
					СтрокаЗаполнения = КонтактнаяИнформацияДляЗаполнения.Добавить();
					СтрокаЗаполнения.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
					СтрокаЗаполнения.Представление = СокрЛП(СтрокаТЧ.ЭлектроннаяПочта);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТЧ.Телефон) Тогда
					СтрокаЗаполнения = КонтактнаяИнформацияДляЗаполнения.Добавить();
					СтрокаЗаполнения.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
					СтрокаЗаполнения.Представление = СокрЛП(СтрокаТЧ.Телефон);
				КонецЕсли;

				УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ПользовательОбъект, КонтактнаяИнформацияДляЗаполнения, Истина);
				
			КонецЕсли;		
			
			ПользовательОбъект.Записать();
			Пользователь =  ПользовательОбъект.Ссылка;
				
			// Помещаем в группу пользователей
			
			ГруппаПользователя = ПолучитьЭлементСправочника("ГруппыПользователей", СтрокаТЧ.ГруппаПользователей,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			
			Если ЗначениеЗаполнено(ГруппаПользователя) Тогда
			
				ГруппаПользователяОбъект = ГруппаПользователя.ПолучитьОбъект();			
				Если ГруппаПользователяОбъект.Состав.Найти(Пользователь, "Пользователь") = Неопределено Тогда
					СтрокаСостава = ГруппаПользователяОбъект.Состав.Добавить();
					СтрокаСостава.Пользователь = Пользователь;
				КонецЕсли;
				ГруппаПользователяОбъект.Записать();
				
				Если МассивГруппПользователей.Найти(ГруппаПользователя) = Неопределено Тогда
					МассивГруппПользователей.Добавить(ГруппаПользователя);
				КонецЕсли;
				
			КонецЕсли;			
			
			// Помещаем в группу доступа
					
			ГруппаДоступа = ПолучитьЭлементСправочника("ГруппыДоступа", СтрокаТЧ.ГруппаДоступа,,Ложь);
			
			Если ЗначениеЗаполнено(ГруппаДоступа) Тогда
				
				ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
				
				Если ГруппаДоступаОбъект.Пользователи.Найти(Пользователь, "Пользователь") = Неопределено Тогда
					ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Пользователь;
				КонецЕсли;
				
				ГруппаДоступаОбъект.Записать();
				
			КонецЕсли;

			// Создаем студента
			
			Курс = ПолучитьЭлементСправочника("КурсыОО", СтрокаТЧ.Курс,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			УчебнаяГруппа = ПолучитьЭлементСправочника("УчебныеГруппыОО", СтрокаТЧ.УчебнаяГруппа,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			Статус = ПолучитьЭлементСправочника("СтатусыСтудентовОО", СтрокаТЧ.Статус,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			Специализация = ПолучитьЭлементСправочника("СпециализацииОО", СтрокаТЧ.Специализация,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			Специальность = ПолучитьЭлементСправочника("СпециальностиОО", СтрокаТЧ.Специальность,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			ФормаОбучения = ПолучитьЭлементСправочника("ФормыОбученияОО", СтрокаТЧ.ФормаОбучения,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			Отделение = ПолучитьЭлементСправочника("ОтделенияОО", СтрокаТЧ.Отделение,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			
			Если ЗначениеЗаполнено(Курс)
				ИЛИ ЗначениеЗаполнено(УчебнаяГруппа)
				ИЛИ ЗначениеЗаполнено(Статус)
				ИЛИ ЗначениеЗаполнено(Специализация)
				ИЛИ ЗначениеЗаполнено(Специальность)
				ИЛИ ЗначениеЗаполнено(ФормаОбучения)
				ИЛИ ЗначениеЗаполнено(Отделение) Тогда
			
				СвойстваЗаписиРегистраСтудентов = НайтиЗаписьОСтуденте(Пользователь, Курс, УчебнаяГруппа, Статус, Специализация, Специальность, ФормаОбучения, Отделение);
				
				Если СвойстваЗаписиРегистраСтудентов = Неопределено Тогда
					ЗаписьРегистраСтудентов = РегистрыСведений.СтудентыОО.СоздатьМенеджерЗаписи();
					ЗаписьРегистраСтудентов.Период = ТекущаяДатаСеанса();
					ЗаписьРегистраСтудентов.Пользователь = Пользователь;
					ЗаписьРегистраСтудентов.Курс = Курс;
					ЗаписьРегистраСтудентов.УчебнаяГруппа = УчебнаяГруппа;
					ЗаписьРегистраСтудентов.Статус = Статус;
					ЗаписьРегистраСтудентов.Специализация = Специализация;
					ЗаписьРегистраСтудентов.Специальность = Специальность;
					ЗаписьРегистраСтудентов.ФормаОбучения = ФормаОбучения;
					ЗаписьРегистраСтудентов.Отделение = Отделение;
					ЗаписьРегистраСтудентов.Записать();
				КонецЕсли;
				
			КонецЕсли;	
			
			// Устанавливаем время доступа
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ПродолжительностьДоступаВДнях)
				И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаТЧ.ПродолжительностьДоступаВДнях) Тогда
				
				Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияВремениДоступаКПрограммеСУО") Тогда
					ВызватьИсключение НСтр("ru = 'Для установки ограничения времени доступа включите флажок «Использовать ограничения доступа к программе» в форме «Настройки обучения» раздела Администрирование'")
				КонецЕсли;
				
				ОграничениеПоВремениЧисло = Число(СтрокаТЧ.ПродолжительностьДоступаВДнях); // В днях
				
				Если ОграничениеПоВремениЧисло > 0 Тогда
					
					ДатаНачалаДоступа = ТекущаяДатаСеанса();
					ДатаОкончанияДоступа = ДатаНачалаДоступа + ОграничениеПоВремениЧисло*24*60*60;
					
					РегистрыСведений.ВремяДоступаПользователейСУО.УстановитьВремяДоступа(Пользователь, ДатаНачалаДоступа, ДатаОкончанияДоступа);
					
				КонецЕсли;			
				
			КонецЕсли;
			
			// Назначаем на проведение обучения
			
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерПроведенияПрограммыОбучения) Тогда
				
				ПроведениеПрограммыОбучения	= ПолучитьДокументПоНомеру("ПроведениеПрограммыОбученияСУО", СтрокаТЧ.НомерПроведенияПрограммыОбучения);
				УправлениеОбучениемСУО.ЗачислитьУчастникаНаПрограммуОбучения(ПроведениеПрограммыОбучения, Пользователь);				
				
			КонецЕсли;
						
			// Добавляем новость
			
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерНовости) Тогда
				
				Новость	= ПолучитьДокументПоНомеру("НовостьСУО", СтрокаТЧ.НомерНовости);
				
				НовостьОбъект = Новость.ПолучитьОбъект();
						
				Если НовостьОбъект.Получатели.Найти(Пользователь, "Пользователь") = Неопределено Тогда
					НовостьОбъект.Получатели.Добавить().Пользователь = Пользователь;
				КонецЕсли;
				
				Если НовостьОбъект.Проведен Тогда
					НовостьОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					НовостьОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецЕсли;
			
			// Добавляем организатору
			
			Организатор = ПолучитьЭлементСправочника("ОрганизаторыСУО", СтрокаТЧ.Организатор,,СоздаватьЭлементыСправочниковПриИхОтсутствии);
			
			Если ЗначениеЗаполнено(Организатор) Тогда
				
				ОрганизаторОбъект = Организатор.ПолучитьОбъект();
						
				Если ОрганизаторОбъект.Видимость.Найти(Пользователь, "Пользователь") = Неопределено Тогда
					ОрганизаторОбъект.Видимость.Добавить().Пользователь = Пользователь;
				КонецЕсли;
				
				ОрганизаторОбъект.Записать();				
			
			КонецЕсли;
			
		КонецЦикла;		
		
		// Обновляем группы пользователей
		Для каждого ГруппаДляДобавления Из МассивГруппПользователей Цикл
			ПользователиСлужебный.ОбновитьСоставыГруппПользователей(ГруппаДляДобавления);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Объект.ЗагрузкаСтудентов.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементСправочника(Знач ИмяСправочника, Знач СтроковоеЗначение, Знач Владелец = Неопределено, Знач СоздаватьЭлементСправочника = Ложь)
	
	Если НЕ ЗначениеЗаполнено(СтроковоеЗначение) Тогда
		Возврат Справочники[ИмяСправочника].ПустаяСсылка();
	КонецЕсли;
	
	ЗначениеСправочника = Справочники[ИмяСправочника].НайтиПоНаименованию(СтроковоеЗначение, Истина,,Владелец);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеСправочника) Тогда
		Если СоздаватьЭлементСправочника Тогда
			НовыйЭлементСправочникаОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
			НовыйЭлементСправочникаОбъект.Наименование = СтроковоеЗначение;
			Если Владелец <> Неопределено Тогда
				НовыйЭлементСправочникаОбъект.Владелец = Владелец;
			КонецЕсли;
			Для каждого РеквизитСправочника Из Метаданные.Справочники[ИмяСправочника].Реквизиты Цикл
				ТипыРеквизита = РеквизитСправочника.Тип.Типы();
				ЕдинственныйТип = ?(ТипыРеквизита.Количество() = 1, ТипыРеквизита[0], Тип("Неопределено"));
				Если РеквизитСправочника.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку
					И ОбщегоНазначения.ЭтоСсылка(ЕдинственныйТип) 
					И ОбщегоНазначения.ВидОбъектаПоТипу(ЕдинственныйТип) = "Справочник" Тогда
					СтроковоеПредставлениеТипа = ОбщегоНазначения.СтроковоеПредставлениеТипа(ЕдинственныйТип);
					СтроковоеПредставлениеТипаИмяСправочника = СтрРазделить(СтроковоеПредставлениеТипа, ".", Ложь)[1];										
					ВложенныйЭлемент = ПолучитьЭлементСправочника(СтроковоеПредставлениеТипаИмяСправочника, СтроковоеЗначение, Неопределено, Ложь); // Рекурсия
					НовыйЭлементСправочникаОбъект[РеквизитСправочника.Имя] = ВложенныйЭлемент; 
				КонецЕсли;			
			КонецЦикла;
			НовыйЭлементСправочникаОбъект.ПроверитьЗаполнение();
		    НовыйЭлементСправочникаОбъект.Записать();
			ЗначениеСправочника = НовыйЭлементСправочникаОбъект.Ссылка;
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Элемент ""%1"" справочника %2 не найден'"), СтроковоеЗначение, ИмяСправочника);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеСправочника;

	
КонецФункции

&НаСервере
Функция ПолучитьДокументПоНомеру(Знач ИмяДокумента, Знач НомерДокумента)
	
	Если НЕ ЗначениеЗаполнено(НомерДокумента) Тогда
		Возврат Документы[ИмяДокумента].ПустаяСсылка();
	КонецЕсли;
	
	СсылкаНаДокумент = Документы[ИмяДокумента].НайтиПоНомеру(НомерДокумента);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ ""%1"" по номеру %2 не найден'"), ИмяДокумента, НомерДокумента);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Возврат СсылкаНаДокумент;
		
КонецФункции

&НаСервере
Функция НайтиЗаписьОСтуденте(Пользователь, Курс, УчебнаяГруппа, Статус, Специализация, Специальность, ФормаОбучения, Отделение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтудентыОО.Пользователь,
		|	СтудентыОО.Период КАК Период
		|ИЗ
		|	РегистрСведений.СтудентыОО КАК СтудентыОО
		|ГДЕ
		|	СтудентыОО.Пользователь = &Пользователь
		|	И СтудентыОО.Курс = &Курс
		|	И СтудентыОО.УчебнаяГруппа = &УчебнаяГруппа
		|	И СтудентыОО.Статус = &Статус
		|	И СтудентыОО.Специализация = &Специализация
		|	И СтудентыОО.Специальность = &Специальность
		|	И СтудентыОО.ФормаОбучения = &ФормаОбучения
		|	И СтудентыОО.Отделение = &Отделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Курс", Курс);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Специализация", Специализация);
	Запрос.УстановитьПараметр("Специальность", Специальность);
	Запрос.УстановитьПараметр("Статус", Статус);
	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппа);
	Запрос.УстановитьПараметр("ФормаОбучения", ФормаОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	    ВыборкаДетальныеЗаписи.Следующий();
		Возврат Новый Структура("Пользователь, Период", ВыборкаДетальныеЗаписи.Пользователь, ВыборкаДетальныеЗаписи.Период);
	КонецЕсли;
	
КонецФункции

// Загрузка из программ

// Открывает файл обмена во внешнем приложении.
//
// Параметры:
//  
// 
&НаКлиенте
Процедура ОткрытьВПриложении(ИмяФайла, СтандартнаяОбработка = Ложь)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяФайла", ИмяФайла);
	ДополнительныеПараметры.Вставить("ОписаниеОповещения", Новый ОписаниеОповещения("ОткрытьКаталогСФайлом", ЭтотОбъект, ДополнительныеПараметры));
	
	Файл = Новый Файл();
	Файл.НачатьИнициализацию(Новый ОписаниеОповещения("ПроверитьСуществованиеФайла", ЭтотОбъект, ДополнительныеПараметры), ИмяФайла);
	
КонецПроцедуры

// Продолжение процедуры (см. выше).
&НаКлиенте
Процедура ПроверитьСуществованиеФайла(Файл, ДополнительныеПараметры) Экспорт
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОпределенияСуществованияФайла", ЭтотОбъект, ДополнительныеПараметры);
	Файл.НачатьПроверкуСуществования(ОписаниеОповещения);
КонецПроцедуры

// Продолжение процедуры (см. выше).
&НаКлиенте
Процедура ПослеОпределенияСуществованияФайла(Существует, ДополнительныеПараметры) Экспорт
	
	Если Существует Тогда
		НачатьЗапускПриложения(ДополнительныеПараметры.ОписаниеОповещения, ДополнительныеПараметры.ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

// Продолжение процедуры (см. выше).
&НаКлиенте
Процедура ОткрытьКаталогСФайлом(КодВозврата, ДополнительныеПараметры) Экспорт
	// Обработка не требуется.
КонецПроцедуры

&НаСервере
Процедура ТипИнформационнойБазыДляПодключенияПриИзмененииЗначения()
	
	ТипБазы = Элементы.ТипБазы;
	ТипБазы.ТекущаяСтраница = ?(Объект.ТипИнформационнойБазыДляПодключения,
								ТипБазы.ПодчиненныеЭлементы.ФайловаяБаза,
								ТипБазы.ПодчиненныеЭлементы.БазаНаСервере);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьДанные()
	
	Результат = ""; // Будет показан в форме
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.ИмпортСтудентовОО"));
	
	Возврат ОбработкаОбъект.ВыполнитьИмпорт(Результат, АдресФайлаВоВременномХранилище);
	
КонецФункции

&НаКлиенте
Процедура ПродолжениеЗагрузкиФайла(РезультатЗагрузки, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатЗагрузки Тогда
		Возврат;
	КонецЕсли;	
	
	АдресФайлаВоВременномХранилище = Адрес; // Сохраняем в реквизите
	
	Результат = ""; // Будет показан в форме
	
	ФайлУспешноИмпортирован = Ложь;
	ФайлУспешноИмпортирован = ЗагрузитьДанные();
	
	Если НЕ ФайлУспешноИмпортирован Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'В процессе импорта возникли ошибки'"));	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключение(ИмяПравил, ИмяПродукта)
	
	#Если ВебКлиент Тогда
		
	ПоказатьПредупреждение(,НСтр("ru = 'Подключение к удаленной базе в веб-клиенте не поддерживается'"));
	
	Возврат;
	
	#Иначе

	Если ОбщегоНазначенияКлиентСервер.ЭтоLinuxКлиент() Тогда
	
		ПоказатьПредупреждение(,НСтр("ru = 'Подключение к удаленной базе в Linux клиенте не поддерживается'"));
	
	Иначе

		РежимЗагрузки = "Подключение";
		ИмяПравилОбмена = ИмяПравил;	// Реквизит формы	
		Элементы.ГруппаПодключение.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подключение - %1'"), ИмяПродукта);
		УстановитьВидимостьЭлементовФормы();
		
	КонецЕсли;
			
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзБазы(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
	Состояние(НСтр("ru = 'Выполняется подключение к внешней базе'"));

	ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.СтруктураПараметровДляУстановкиВнешнегоСоединения();
	ПараметрыПодключения.ВариантРаботыИнформационнойБазы             = ?(Объект.ТипИнформационнойБазыДляПодключения, 0, 1);
	ПараметрыПодключения.КаталогИнформационнойБазы                   = Объект.КаталогИнформационнойБазыДляПодключения;
	ПараметрыПодключения.ИмяСервера1СПредприятия                     = Объект.ИмяСервераИнформационнойБазыДляПодключения;
	ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия = Объект.ИмяИнформационнойБазыНаСервереДляПодключения;
	ПараметрыПодключения.АутентификацияОперационнойСистемы           = Объект.АутентификацияWindowsИнформационнойБазыДляПодключения;
	ПараметрыПодключения.ИмяПользователя                             = Объект.ПользовательИнформационнойБазыДляПодключения;
	ПараметрыПодключения.ПарольПользователя                          = Объект.ПарольИнформационнойБазыДляПодключения;
	
	РезультатСоединения = ОбщегоНазначенияКлиентСервер.УстановитьВнешнееСоединениеСБазой(ПараметрыПодключения);
	
	Если РезультатСоединения.Соединение = Неопределено Тогда
		
		ВызватьИсключение РезультатСоединения.КраткоеОписаниеОшибки;
		
	Иначе
		
		Состояние(НСтр("ru = 'Выполняется выгрузка данных'"));
		
		ИмяФайлаПравил = ПолучитьИмяВременногоФайла(".xml");
		
		ТекстПравилОбмена = ТекстМакетаПравилОбмена(ИмяПравилОбмена);
		Текст = Новый ЗаписьТекста(ИмяФайлаПравил, КодировкаТекста.UTF8);
		Текст.ЗаписатьСтроку(ТекстПравилОбмена);
		Текст.Закрыть();

		ИмяФайлаОбмена = ПолучитьИмяВременногоФайла(".xml");
		
		ОбработкаОбмена = РезультатСоединения.Соединение.Обработки.УниверсальныйОбменДаннымиXML.Создать();
		ОбработкаОбмена.РежимОбмена												= "Выгрузка";
		ОбработкаОбмена.НеВыводитьНикакихИнформационныхСообщенийПользователю	= Истина;
		ОбработкаОбмена.ИмяФайлаПравилОбмена									= ИмяФайлаПравил;
		ОбработкаОбмена.ЗагрузитьПравилаОбмена();
		ОбработкаОбмена.ИмяФайлаОбмена = ИмяФайлаОбмена;
		ОбработкаОбмена.ВыполнитьВыгрузку();
		
		АдресФайлаВоВременномХранилище = Неопределено;
		
		ПоместитьФайл(АдресФайлаВоВременномХранилище, ИмяФайлаОбмена,,Ложь,УникальныйИдентификатор); 
		
		РежимЗагрузки = "Файл";
		
		Результат = ""; // Будет показан в форме
		
		Состояние(НСтр("ru = 'Выполняется загрузка данных'"));
		
		ФайлУспешноИмпортирован = Ложь;
		ФайлУспешноИмпортирован = ЗагрузитьДанные();
		
		Если НЕ ФайлУспешноИмпортирован Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'В процессе импорта возникли ошибки'"));	
		КонецЕсли;		
		
		Попытка
			УдалитьФайлы(ИмяФайлаПравил);
			УдалитьФайлы(ИмяФайлаОбмена);
		Исключение			
		КонецПопытки;
		
	КонецЕсли;
	
	#КонецЕсли

КонецПроцедуры

&НаСервереБезКонтекста 
Функция ТекстМакетаПравилОбмена(ИмяМакета) 
	Возврат Обработки.ИмпортСтудентовОО.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецФункции

// Общее

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Если РежимЗагрузки = "Подключение" Тогда
		Элементы.ГруппаПодключение.Видимость = Истина;
	Иначе
		Элементы.ГруппаПодключение.Видимость = Ложь;
	КонецЕсли;
	
	Если РежимЗагрузки = "Таблица" Тогда
		Элементы.ГруппаТаблица.Видимость = Истина;
	Иначе
		Элементы.ГруппаТаблица.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры



#КонецОбласти
